TexasInstruments/c2000ware-core-sdk/device_support/f2805x/common/source/F2805x_SWPrioritizedDefaultIsr.c
}
#endif

#if (G24PL != 0)
//
// EPWM4_TZINT_ISR - ePWM4 Trip Zone
// Connected to PIEIER2_4 (use MINT2 and MG24 masks):
//
__interrupt void
EPWM4_TZINT_ISR(void)
{
    //
    // Set __interrupt priority
    //
    volatile Uint16 TempPIEIER = PieCtrlRegs.PIEIER2.all;
    IER |= M_INT2;
    IER &= MINT2;                       // Set "global" priority
    PieCtrlRegs.PIEIER2.all &= MG24;    // Set "group"  priority
    PieCtrlRegs.PIEACK.all = 0xFFFF;    // Enable PIE __interrupts
    EINT;

    //
    // Insert ISR Code here
    //

    //
    // Restore registers saved
    //
    DINT;
    PieCtrlRegs.PIEIER2.all = TempPIEIER;

    //
    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    //
    asm ("      ESTOP0");
    for(;;);
}
#endif

#if (G25PL != 0)
//
// EPWM5_TZINT_ISR - ePWM5 Trip Zone
// Connected to PIEIER2_5 (use MINT2 and MG25 masks):
//
__interrupt void
EPWM5_TZINT_ISR(void)
{
    //
    // Set __interrupt priority
    //
    volatile Uint16 TempPIEIER = PieCtrlRegs.PIEIER2.all;
    IER |= M_INT2;
    IER &= MINT2;                       // Set "global" priority
    PieCtrlRegs.PIEIER2.all &= MG25;    // Set "group"  priority
    PieCtrlRegs.PIEACK.all = 0xFFFF;    // Enable PIE __interrupts
    EINT;

    //
    // Insert ISR Code here
    //

    //
    // Restore registers saved
    //
    DINT;
    PieCtrlRegs.PIEIER2.all = TempPIEIER;

    //
    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    //
    asm ("      ESTOP0");
    for(;;);
}
#endif

#if (G24PL != 0)
//
// EPWM6_TZINT_ISR - ePWM6 Trip Zone
// Connected to PIEIER2_6 (use MINT2 and MG26 masks):
//
__interrupt void
EPWM6_TZINT_ISR(void)
{
    //
    // Set __interrupt priority
    //
    volatile Uint16 TempPIEIER = PieCtrlRegs.PIEIER2.all;
    IER |= M_INT2;
    IER &= MINT2;                       // Set "global" priority
    PieCtrlRegs.PIEIER2.all &= MG26;    // Set "group"  priority
    PieCtrlRegs.PIEACK.all = 0xFFFF;    // Enable PIE __interrupts
    EINT;

    //
    // Insert ISR Code here
    //

    //
    // Restore registers saved
    //
    DINT;
    PieCtrlRegs.PIEIER2.all = TempPIEIER;

    //
    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    //
    asm ("      ESTOP0");
    for(;;);
}
#endif

#if (G27PL != 0)
//
// EPWM7_TZINT_ISR - ePWM7 Trip Zone
// Connected to PIEIER2_7 (use MINT2 and MG27 masks)
//
__interrupt void
EPWM7_TZINT_ISR(void)
{
    //
    // Set __interrupt priority
    //
    volatile Uint16 TempPIEIER = PieCtrlRegs.PIEIER2.all;
    IER |= M_INT2;
    IER &= MINT2;                       // Set "global" priority
    PieCtrlRegs.PIEIER2.all &= MG27;    // Set "group"  priority
    PieCtrlRegs.PIEACK.all = 0xFFFF;    // Enable PIE __interrupts
    EINT;

    //
    // Insert ISR Code here
    //

    //
    // Restore registers saved
    //
    DINT;
    PieCtrlRegs.PIEIER2.all = TempPIEIER;

    //
    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    //
    asm ("      ESTOP0");
    for(;;);
}
#endif

//
// PIE Group 3 - MUXed into CPU INT3
//

#if (G31PL != 0)
//
// EPWM1_INT_ISR - ePWM1 Interrupt
// Connected to PIEIER3_1 (use MINT3 and MG31 masks)
//
__interrupt void
EPWM1_INT_ISR(void)
{
    //
    // Set __interrupt priority
    //
    volatile Uint16 TempPIEIER = PieCtrlRegs.PIEIER3.all;
    IER |= M_INT3;
    IER &= MINT3;                      // Set "global" priority
    PieCtrlRegs.PIEIER3.all &= MG31;   // Set "group"  priority
    PieCtrlRegs.PIEACK.all = 0xFFFF;   // Enable PIE __interrupts
    EINT;

    //
    // Insert ISR Code here
    //

    //
    // Restore registers saved
    //
    DINT;
    PieCtrlRegs.PIEIER3.all = TempPIEIER;

    //
    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    //
    asm ("      ESTOP0");
    for(;;);
}
#endif

#if (G32PL != 0)
//
// EPWM2_INT_ISR - ePWM2 Interrupt
// Connected to PIEIER3_2 (use MINT3 and MG32 masks)
//
__interrupt void
EPWM2_INT_ISR(void)
{
    //
    // Set __interrupt priority
    //
    volatile Uint16 TempPIEIER = PieCtrlRegs.PIEIER3.all;
    IER |= M_INT3;
    IER &= MINT3;                      // Set "global" priority
    PieCtrlRegs.PIEIER3.all &= MG32;   // Set "group"  priority
    PieCtrlRegs.PIEACK.all = 0xFFFF;   // Enable PIE __interrupts
    EINT;

    //
    // Insert ISR Code here
    //

    //
    // Restore registers saved
    //
    DINT;
    PieCtrlRegs.PIEIER3.all = TempPIEIER;

    //
    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    //
    asm ("      ESTOP0");
    for(;;);
}
#endif

#if (G33PL != 0)
//
// EPWM3_INT_ISR -  ePWM3 Interrupt
// Connected to PIEIER3_3 (use MINT3 and MG33 masks)
//
__interrupt void
EPWM3_INT_ISR(void)
{
    //
    // Set __interrupt priority
    //
    volatile Uint16 TempPIEIER = PieCtrlRegs.PIEIER3.all;
    IER |= M_INT3;
    IER &= MINT3;                       // Set "global" priority
    PieCtrlRegs.PIEIER3.all &= MG33;   // Set "group"  priority
    PieCtrlRegs.PIEACK.all = 0xFFFF;   // Enable PIE __interrupts
    EINT;

    //
    // Insert ISR Code here
    //

    //
    // Restore registers saved
    //
    DINT;
    PieCtrlRegs.PIEIER3.all = TempPIEIER;

    //
    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    //
    asm ("      ESTOP0");
    for(;;);
}
#endif

#if (G34PL != 0)
//
// EPWM4_INT_ISR - ePWM4 Interrupt
// Connected to PIEIER3_4 (use MINT3 and MG34 masks)
//
__interrupt void
EPWM4_INT_ISR(void)
{
    //
    // Set __interrupt priority
    //
    volatile Uint16 TempPIEIER = PieCtrlRegs.PIEIER3.all;
    IER |= M_INT3;
    IER &= MINT3;                      // Set "global" priority
    PieCtrlRegs.PIEIER3.all &= MG34;   // Set "group"  priority
    PieCtrlRegs.PIEACK.all = 0xFFFF;   // Enable PIE __interrupts
    EINT;

    //
    // Insert ISR Code here
    //

    //
    // Restore registers saved
    //
    DINT;
    PieCtrlRegs.PIEIER3.all = TempPIEIER;

    //
    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    //
    asm ("      ESTOP0");
    for(;;);
}
#endif

#if (G34PL != 0)
//
// EPWM5_INT_ISR - ePWM5 Interrupt
// Connected to PIEIER3_5 (use MINT3 and MG35 masks)
//
__interrupt void
EPWM5_INT_ISR(void)
{
    //
    // Set __interrupt priority
    //
    volatile Uint16 TempPIEIER = PieCtrlRegs.PIEIER3.all;
    IER |= M_INT3;
    IER &= MINT3;                      // Set "global" priority
    PieCtrlRegs.PIEIER3.all &= MG35;   // Set "group"  priority
    PieCtrlRegs.PIEACK.all = 0xFFFF;   // Enable PIE __interrupts
    EINT;

    //
    // Insert ISR Code here
    //

    //
    // Restore registers saved
    //
    DINT;
    PieCtrlRegs.PIEIER3.all = TempPIEIER;

    //
    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    //
    asm ("      ESTOP0");
    for(;;);
}
#endif

#if (G36PL != 0)
//
// EPWM6_INT_ISR - ePWM6 Interrupt
// Connected to PIEIER3_6 (use MINT3 and MG36 masks)
//
__interrupt void
EPWM6_INT_ISR(void)
{
    //
    // Set __interrupt priority
    //
    volatile Uint16 TempPIEIER = PieCtrlRegs.PIEIER3.all;
    IER |= M_INT3;
    IER &= MINT3;                      // Set "global" priority
    PieCtrlRegs.PIEIER3.all &= MG36;   // Set "group"  priority
    PieCtrlRegs.PIEACK.all = 0xFFFF;   // Enable PIE __interrupts
    EINT;

    //
    // Insert ISR Code here
    //

    //
    // Restore registers saved
    //
    DINT;
    PieCtrlRegs.PIEIER3.all = TempPIEIER;

    //
    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    //
    asm ("      ESTOP0");
    for(;;);
}
#endif

