TexasInstruments/c2000ware-core-sdk/device_support/f2805x/common/source/F2805x_SWPrioritizedDefaultIsr.c
#if (G86PL != 0)
//
// SCITXINTC_ISR - SCI-C
// Connected to PIEIER8_6 (use MINT8 and MG86 masks):
//
__interrupt void
SCITXINTC_ISR(void)
{
    //
    // Set __interrupt priority
    //
    volatile Uint16 TempPIEIER = PieCtrlRegs.PIEIER8.all;
    IER |= M_INT8;
    IER &= MINT8;                      // Set "global" priority
    PieCtrlRegs.PIEIER8.all &= MG86;   // Set "group"  priority
    PieCtrlRegs.PIEACK.all = 0xFFFF;   // Enable PIE __interrupts
    EINT;

    //
    // Insert ISR Code here
    //

    //
    // Restore registers saved
    //
    DINT;
    PieCtrlRegs.PIEIER8.all = TempPIEIER;

    //
    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    //
    asm ("      ESTOP0");
    for(;;);
}
#endif

//
// PIE Group 9 - MUXed into CPU INT9
//

#if (G91PL != 0)
//
// SCIRXINTA_ISR - SCI-A3
// Connected to PIEIER9_1 (use MINT9 and MG91 masks)
//
__interrupt void
SCIRXINTA_ISR(void)
{
    //
    // Set __interrupt priority
    //
    volatile Uint16 TempPIEIER = PieCtrlRegs.PIEIER9.all;
    IER |= M_INT9;
    IER &= MINT9;                       // Set "global" priority
    PieCtrlRegs.PIEIER9.all &= MG91;   // Set "group"  priority
    PieCtrlRegs.PIEACK.all = 0xFFFF;   // Enable PIE __interrupts
    EINT;

    //
    // Insert ISR Code here
    //

    //
    // Restore registers saved
    //
    DINT;
    PieCtrlRegs.PIEIER9.all = TempPIEIER;

    //
    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    //
    asm ("      ESTOP0");
    for(;;);
}
#endif

#if (G92PL != 0)
//
// SCITXINTA_ISR - SCI-A
// Connected to PIEIER9_2 (use MINT9 and MG92 masks)
//
__interrupt void
SCITXINTA_ISR(void)
{
    //
    // Set __interrupt priority
    //
    volatile Uint16 TempPIEIER = PieCtrlRegs.PIEIER9.all;
    IER |= M_INT9;
    IER &= MINT9;                      // Set "global" priority
    PieCtrlRegs.PIEIER9.all &= MG92;   // Set "group"  priority
    PieCtrlRegs.PIEACK.all = 0xFFFF;   // Enable PIE __interrupts
    EINT;

    //
    // Insert ISR Code here
    //

    //
    // Restore registers saved
    //
    DINT;
    PieCtrlRegs.PIEIER9.all = TempPIEIER;

    //
    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    //
    asm ("      ESTOP0");
    for(;;);

}
#endif

#if (G93PL != 0)
//
// SCIRXINTB_ISR - SCI-B
// Connected to PIEIER9_3 (use MINT9 and MG93 masks)
//
__interrupt void
SCIRXINTB_ISR(void)
{
    //
    // Set __interrupt priority
    //
    volatile Uint16 TempPIEIER = PieCtrlRegs.PIEIER9.all;
    IER |= M_INT9;
    IER &= MINT9;                      // Set "global" priority
    PieCtrlRegs.PIEIER9.all &= MG93;   // Set "group"  priority
    PieCtrlRegs.PIEACK.all = 0xFFFF;   // Enable PIE __interrupts
    EINT;

    //
    // Insert ISR Code here
    //

    //
    // Restore registers saved
    //
    DINT;
    PieCtrlRegs.PIEIER9.all = TempPIEIER;

    //
    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    //
    asm ("      ESTOP0");
    for(;;);

}
#endif

#if (G94PL != 0)
//
// SCITXINTB_ISR - SCI-B
// Connected to PIEIER9_4 (use MINT9 and MG94 masks):
//
__interrupt void
SCITXINTB_ISR(void)
{
    //
    // Set __interrupt priority
    //
    volatile Uint16 TempPIEIER = PieCtrlRegs.PIEIER9.all;
    IER |= M_INT9;
    IER &= MINT9;                      // Set "global" priority
    PieCtrlRegs.PIEIER9.all &= MG94;   // Set "group"  priority
    PieCtrlRegs.PIEACK.all = 0xFFFF;   // Enable PIE __interrupts
    EINT;

    //
    // Insert ISR Code here
    //

    //
    // Restore registers saved
    //
    DINT;
    PieCtrlRegs.PIEIER9.all = TempPIEIER;

    //
    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    //
    asm ("      ESTOP0");
    for(;;);

}
#endif

#if (G95PL != 0)
//
// ECAN0INTA_ISR - eCAN-A
// Connected to PIEIER9_5 (use MINT9 and MG95 masks)
//
__interrupt void
ECAN0INTA_ISR(void)
{
    //
    // Set __interrupt priority
    //
    volatile Uint16 TempPIEIER = PieCtrlRegs.PIEIER9.all;
    IER |= M_INT9;
    IER &= MINT9;                      // Set "global" priority
    PieCtrlRegs.PIEIER9.all &= MG95;   // Set "group"  priority
    PieCtrlRegs.PIEACK.all = 0xFFFF;   // Enable PIE __interrupts
    EINT;

    //
    // Insert ISR Code here
    //

    //
    // Restore registers saved
    //
    DINT;
    PieCtrlRegs.PIEIER9.all = TempPIEIER;

    //
    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    //
    asm ("      ESTOP0");
    for(;;);
}
#endif

#if (G96PL != 0)
//
// ECAN1INTA_ISR - eCAN-A
// Connected to PIEIER9_6 (use MINT9 and MG96 masks)
//
__interrupt void
ECAN1INTA_ISR(void)
{
    //
    // Set __interrupt priority
    //
    volatile Uint16 TempPIEIER = PieCtrlRegs.PIEIER9.all;
    IER |= M_INT9;
    IER &= MINT9;                      // Set "global" priority
    PieCtrlRegs.PIEIER9.all &= MG96;   // Set "group"  priority
    PieCtrlRegs.PIEACK.all = 0xFFFF;   // Enable PIE __interrupts
    EINT;

    //
    // Insert ISR Code here
    //

    //
    // Restore registers saved
    //
    DINT;
    PieCtrlRegs.PIEIER9.all = TempPIEIER;

    //
    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    //
    asm ("      ESTOP0");
    for(;;);
}
#endif

//
// PIE Group 10 - MUXed into CPU INT10
//

//
// Uncomment the below if ADCINT1 and ADCINT2 in the 10.1 and 10.2
// PIE interrupt spaces are enabled. Then comment out the equivalent
// 1.1 and 1.2 interrupt service routines.
//

/*
#if (G101PL != 0)
//
// ADCINT1_ISR -  ADC
// Connected to PIEIER10_1 (use MINT10 and MG101 masks)
//
__interrupt void
ADCINT1_ISR(void)
{
    //
    // Set __interrupt priority
    //
    volatile Uint16 TempPIEIER = PieCtrlRegs.PIEIER10.all;
    IER |= MINT10;                     // Set "global" priority
    PieCtrlRegs.PIEIER10.all &= MG101; // Set "group"  priority
    PieCtrlRegs.PIEACK.all = 0xFFFF;   // Enable PIE __interrupts
    EINT;

    //
    // Restore registers saved
    //
    DINT;
    PieCtrlRegs.PIEIER10.all = TempPIEIER;

    //
    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    //
    asm ("      ESTOP0");
    for(;;);
}
#endif

#if (G102PL != 0)
//
// ADCINT2_ISR - ADC
// Connected to PIEIER10_2 (use MINT10 and MG102 masks)
//
__interrupt void
ADCINT2_ISR(void)
{
    //
    // Set __interrupt priority
    //
    volatile Uint16 TempPIEIER = PieCtrlRegs.PIEIER10.all;
    IER |= MINT10;                     // Set "global" priority
    PieCtrlRegs.PIEIER10.all &= MG102; // Set "group"  priority
    PieCtrlRegs.PIEACK.all = 0xFFFF;   // Enable PIE __interrupts
    EINT;

    //
    // Restore registers saved
    //
    DINT;
    PieCtrlRegs.PIEIER10.all = TempPIEIER;

    //
    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    //
    asm ("      ESTOP0");
    for(;;);
}
#endif

*/

#if (G103PL != 0)
//
// ADCINT3_ISR - ADC
// Connected to PIEIER10_3 (use MINT10 and MG103 masks)
//
__interrupt void
ADCINT3_ISR(void)
{
    //
    // Set __interrupt priority
    //
    volatile Uint16 TempPIEIER = PieCtrlRegs.PIEIER10.all;
    IER |= MINT10;                     // Set "global" priority
    PieCtrlRegs.PIEIER10.all &= MG103; // Set "group"  priority
    PieCtrlRegs.PIEACK.all = 0xFFFF;   // Enable PIE __interrupts
    EINT;

    //
    // Restore registers saved
    //
    DINT;
    PieCtrlRegs.PIEIER10.all = TempPIEIER;

    //
    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    //
    asm ("      ESTOP0");
    for(;;);
}
#endif

