TexasInstruments/c2000ware-core-sdk/device_support/f2805x/common/source/F2805x_SWPrioritizedDefaultIsr.c
#if (G104PL != 0)
//
// ADCINT4_ISR - ADC
// Connected to PIEIER10_4 (use MINT10 and MG104 masks):
//
__interrupt void
ADCINT4_ISR(void)
{
    //
    // Set __interrupt priority
    //
    volatile Uint16 TempPIEIER = PieCtrlRegs.PIEIER10.all;
    IER |= MINT10;                     // Set "global" priority
    PieCtrlRegs.PIEIER10.all &= MG104; // Set "group"  priority
    PieCtrlRegs.PIEACK.all = 0xFFFF;   // Enable PIE __interrupts
    EINT;

    //
    // Restore registers saved
    //
    DINT;
    PieCtrlRegs.PIEIER10.all = TempPIEIER;

    //
    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    //
    asm ("      ESTOP0");
    for(;;);
}
#endif

#if (G105PL != 0)
//
// ADCINT5_ISR - ADC
// Connected to PIEIER10_5 (use MINT10 and MG105 masks):
//
__interrupt void
ADCINT5_ISR(void)
{
    //
    // Set __interrupt priority
    //
    volatile Uint16 TempPIEIER = PieCtrlRegs.PIEIER10.all;
    IER |= MINT10;                     // Set "global" priority
    PieCtrlRegs.PIEIER10.all &= MG105; // Set "group"  priority
    PieCtrlRegs.PIEACK.all = 0xFFFF;   // Enable PIE __interrupts
    EINT;

    //
    // Insert ISR Code here
    //

    //
    // Restore registers saved
    //
    DINT;
    PieCtrlRegs.PIEIER10.all = TempPIEIER;

    //
    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    //
    asm ("      ESTOP0");
    for(;;);
}
#endif

#if (G106PL != 0)
//
// ADCINT6_ISR - ADC
// Connected to PIEIER10_6 (use MINT10 and MG106 masks)
//
__interrupt void
ADCINT6_ISR(void)
{
    //
    // Set __interrupt priority
    //
    volatile Uint16 TempPIEIER = PieCtrlRegs.PIEIER10.all;
    IER |= M_INT10;
    IER &= MINT10;                     // Set "global" priority
    PieCtrlRegs.PIEIER10.all &= MG106; // Set "group"  priority
    PieCtrlRegs.PIEACK.all = 0xFFFF;   // Enable PIE __interrupts
    EINT;

    //
    // Insert ISR Code here
    //

    //
    // Restore registers saved
    //
    DINT;
    PieCtrlRegs.PIEIER10.all = TempPIEIER;

    //
    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    //
    asm ("      ESTOP0");
    for(;;);
}
#endif

#if (G107PL != 0)
//
// ADCINT7_ISR - ADC
// Connected to PIEIER10_7 (use MINT10 and MG107 masks):
//
__interrupt void
ADCINT7_ISR(void)
{
    //
    // Set __interrupt priority
    //
    volatile Uint16 TempPIEIER = PieCtrlRegs.PIEIER10.all;
    IER |= M_INT10;
    IER &= MINT10;                     // Set "global" priority
    PieCtrlRegs.PIEIER10.all &= MG107; // Set "group"  priority
    PieCtrlRegs.PIEACK.all = 0xFFFF;   // Enable PIE __interrupts
    EINT;

    //
    // Insert ISR Code here
    //

    //
    // Restore registers saved
    //
    DINT;
    PieCtrlRegs.PIEIER10.all = TempPIEIER;

    //
    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    //
    asm ("      ESTOP0");
    for(;;);
}
#endif

#if (G108PL != 0)
//
// ADCINT8_ISR - ADC
// Connected to PIEIER10_8 (use MINT10 and MG108 masks)
//
__interrupt void
ADCINT8_ISR(void)
{
    //
    // Set __interrupt priority
    //
    volatile Uint16 TempPIEIER = PieCtrlRegs.PIEIER10.all;
    IER |= M_INT10;
    IER &= MINT10;                     // Set "global" priority
    PieCtrlRegs.PIEIER10.all &= MG108; // Set "group"  priority
    PieCtrlRegs.PIEACK.all = 0xFFFF;   // Enable PIE __interrupts
    EINT;

    //
    // Insert ISR Code here
    //

    //
    // Restore registers saved
    //
    DINT;
    PieCtrlRegs.PIEIER10.all = TempPIEIER;

    //
    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    //
    asm ("      ESTOP0");
    for(;;);
}
#endif


//
// PIE Group 11 - MUXed into CPU INT11
//

#if (G111PL != 0)
//
// CLA1_INT1_ISR - CLA1
// Connected to PIEIER11_1 (use MINT11 and MG111 masks)
//
__interrupt void
CLA1_INT1_ISR(void)
{
    //
    // Set __interrupt priority
    //
    volatile Uint16 TempPIEIER = PieCtrlRegs.PIEIER11.all;
    IER |= MINT11;                     // Set "global" priority
    PieCtrlRegs.PIEIER11.all &= MG111; // Set "group"  priority
    PieCtrlRegs.PIEACK.all = 0xFFFF;   // Enable PIE __interrupts
    EINT;

    //
    // Restore registers saved
    //
    DINT;
    PieCtrlRegs.PIEIER11.all = TempPIEIER;

    //
    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    //
    asm ("      ESTOP0");
    for(;;);
}
#endif

#if (G112PL != 0)
//
// CLA1_INT2_ISR - CLA1
// Connected to PIEIER11_2 (use MINT11 and MG112 masks):
//
__interrupt void
CLA1_INT2_ISR(void)
{
    //
    // Set __interrupt priority
    //
    volatile Uint16 TempPIEIER = PieCtrlRegs.PIEIER11.all;
    IER |= MINT11;                     // Set "global" priority
    PieCtrlRegs.PIEIER11.all &= MG112; // Set "group"  priority
    PieCtrlRegs.PIEACK.all = 0xFFFF;   // Enable PIE __interrupts
    EINT;

    //
    // Restore registers saved
    //
    DINT;
    PieCtrlRegs.PIEIER11.all = TempPIEIER;

    //
    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    //
    asm ("      ESTOP0");
    for(;;);
}
#endif

#if (G113PL != 0)
//
// CLA1_INT3_ISR - CLA1
// Connected to PIEIER11_3 (use MINT11 and MG113 masks)
//
__interrupt void
CLA1_INT3_ISR(void)
{
    //
    // Set __interrupt priority
    //
    volatile Uint16 TempPIEIER = PieCtrlRegs.PIEIER11.all;
    IER |= MINT11;                     // Set "global" priority
    PieCtrlRegs.PIEIER11.all &= MG113; // Set "group"  priority
    PieCtrlRegs.PIEACK.all = 0xFFFF;   // Enable PIE __interrupts
    EINT;

    //
    // Restore registers saved
    //
    DINT;
    PieCtrlRegs.PIEIER11.all = TempPIEIER;

    //
    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    //
    asm ("      ESTOP0");
    for(;;);
}
#endif

#if (G114PL != 0)
//
// CLA1_INT4_ISR - CLA1
// Connected to PIEIER11_4 (use MINT11 and MG114 masks):
//
__interrupt void
CLA1_INT4_ISR(void)
{
    //
    // Set __interrupt priority
    //
    volatile Uint16 TempPIEIER = PieCtrlRegs.PIEIER11.all;
    IER |= MINT11;                     // Set "global" priority
    PieCtrlRegs.PIEIER11.all &= MG114; // Set "group"  priority
    PieCtrlRegs.PIEACK.all = 0xFFFF;   // Enable PIE __interrupts
    EINT;

    //
    // Restore registers saved
    //
    DINT;
    PieCtrlRegs.PIEIER11.all = TempPIEIER;

    //
    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    //
    asm ("      ESTOP0");
    for(;;);
}
#endif

#if (G115PL != 0)
//
// CLA1_INT5_ISR - CLA1
// Connected to PIEIER11_5 (use MINT11 and MG115 masks)
//
__interrupt void
CLA1_INT5_ISR(void)
{
    //
    // Set __interrupt priority
    //
    volatile Uint16 TempPIEIER = PieCtrlRegs.PIEIER11.all;
    IER |= MINT11;                     // Set "global" priority
    PieCtrlRegs.PIEIER11.all &= MG115; // Set "group"  priority
    PieCtrlRegs.PIEACK.all = 0xFFFF;   // Enable PIE __interrupts
    EINT;

    //
    // Insert ISR Code here
    //

    //
    // Restore registers saved
    //
    DINT;
    PieCtrlRegs.PIEIER11.all = TempPIEIER;

    //
    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    //
    asm ("      ESTOP0");
    for(;;);
}
#endif

