TexasInstruments/c2000ware-core-sdk/device_support/f2805x/common/source/F2805x_SWPrioritizedDefaultIsr.c
#if (G116PL != 0)
//
// CLA1_INT6_ISR - CLA1
// Connected to PIEIER11_6 (use MINT11 and MG116 masks):
//
__interrupt void
CLA1_INT6_ISR(void)
{
    //
    // Set __interrupt priority
    //
    volatile Uint16 TempPIEIER = PieCtrlRegs.PIEIER11.all;
    IER |= M_INT11;
    IER &= MINT11;                     // Set "global" priority
    PieCtrlRegs.PIEIER11.all &= MG116; // Set "group"  priority
    PieCtrlRegs.PIEACK.all = 0xFFFF;   // Enable PIE __interrupts
    EINT;

    //
    // Insert ISR Code here
    //

    //
    // Restore registers saved
    //
    DINT;
    PieCtrlRegs.PIEIER11.all = TempPIEIER;

    //
    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    //
    asm ("      ESTOP0");
    for(;;);
}
#endif

#if (G117PL != 0)
//
// CLA1_INT7_ISR - CLA1
// Connected to PIEIER11_7 (use MINT11 and MG117 masks)
//
__interrupt void
CLA1_INT7_ISR(void)
{
    //
    // Set __interrupt priority
    //
    volatile Uint16 TempPIEIER = PieCtrlRegs.PIEIER11.all;
    IER |= M_INT11;
    IER &= MINT11;                     // Set "global" priority
    PieCtrlRegs.PIEIER11.all &= MG117; // Set "group"  priority
    PieCtrlRegs.PIEACK.all = 0xFFFF;   // Enable PIE __interrupts
    EINT;

    //
    // Insert ISR Code here
    //

    //
    // Restore registers saved
    //
    DINT;
    PieCtrlRegs.PIEIER11.all = TempPIEIER;

    //
    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    //
    asm ("      ESTOP0");
    for(;;);
}
#endif

#if (G118PL != 0)
//
// CLA1_INT8_ISR - CLA1
// Connected to PIEIER11_8 (use MINT11 and MG118 masks):
//
__interrupt void
CLA1_INT8_ISR(void)
{
    //
    // Set __interrupt priority
    //
    volatile Uint16 TempPIEIER = PieCtrlRegs.PIEIER11.all;
    IER |= M_INT11;
    IER &= MINT11;                     // Set "global" priority
    PieCtrlRegs.PIEIER11.all &= MG118; // Set "group"  priority
    PieCtrlRegs.PIEACK.all = 0xFFFF;   // Enable PIE __interrupts
    EINT;

    //
    // Insert ISR Code here
    //

    //
    // Restore registers saved
    //
    DINT;
    PieCtrlRegs.PIEIER11.all = TempPIEIER;

    //
    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    //
    asm ("      ESTOP0");
    for(;;);
}
#endif

//
// PIE Group 12 - MUXed into CPU INT12
//

#if (G121PL != 0)
//
// XINT3_ISR - External interrupt
// Connected to PIEIER12_1 (use MINT12 and MG121 masks)
//
__interrupt void
XINT3_ISR(void)
{
    //
    // Set __interrupt priority
    //
    volatile Uint16 TempPIEIER = PieCtrlRegs.PIEIER12.all;
    IER |= M_INT12;
    IER &= MINT12;                      // Set "global" priority
    PieCtrlRegs.PIEIER12.all &= MG121;  // Set "group"  priority
    PieCtrlRegs.PIEACK.all = 0xFFFF;    // Enable PIE __interrupts
    EINT;

    //
    // Insert ISR Code here
    //

    //
    // Restore registers saved
    //
    DINT;
    PieCtrlRegs.PIEIER12.all = TempPIEIER;

    //
    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    //
    asm ("      ESTOP0");
    for(;;);
}
#endif

#if (G127PL != 0)
//
// LVF_ISR - CLA1
// Connected to PIEIER12_7 (use MINT12 and MG127 masks)
//
__interrupt void
LVF_ISR(void)
{
    //
    // Set __interrupt priority
    //
    volatile Uint16 TempPIEIER = PieCtrlRegs.PIEIER12.all;
    IER |= M_INT12;
    IER &= MINT12;                      // Set "global" priority
    PieCtrlRegs.PIEIER12.all &= MG127;  // Set "group"  priority
    PieCtrlRegs.PIEACK.all = 0xFFFF;    // Enable PIE __interrupts
    EINT;

    //
    // Insert ISR Code here
    //

    //
    // Restore registers saved
    //
    DINT;
    PieCtrlRegs.PIEIER12.all = TempPIEIER;

    //
    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    //
    asm ("      ESTOP0");
    for(;;);
}
#endif

#if (G128PL != 0)
//
// LUF_ISR - CLA1
// Connected to PIEIER12_8 (use MINT12 and MG128 masks)
//
__interrupt void
LUF_ISR(void)
{
    //
    // Set __interrupt priority
    //
    volatile Uint16 TempPIEIER = PieCtrlRegs.PIEIER12.all;
    IER |= M_INT12;
    IER &= MINT12;                      // Set "global" priority
    PieCtrlRegs.PIEIER12.all &= MG128;  // Set "group"  priority
    PieCtrlRegs.PIEACK.all = 0xFFFF;    // Enable PIE __interrupts
    EINT;

    //
    // Insert ISR Code here
    //

    //
    // Restore registers saved
    //
    DINT;
    PieCtrlRegs.PIEIER12.all = TempPIEIER;

    //
    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    //
    asm ("      ESTOP0");
    for(;;);
}
#endif

//
// Catch All Default ISRs
//

//
// PIE_RESERVED - Reserved space.  For test.
//
__interrupt void
PIE_RESERVED(void)
{
    asm ("      ESTOP0");
    for(;;);
}

//
// INT_NOTUSED_ISR - Reserved space.  For test.
//
__interrupt void
INT_NOTUSED_ISR(void)
{
    asm ("      ESTOP0");
    for(;;);
}

__interrupt void
rsvd_ISR(void)      // For test
{
    asm ("      ESTOP0");
    for(;;);
}

//
// End of file.
//

